In [2]:
import pandas as pd

s = pd.Series([10,20,30,40,50])
s

# pandas는 자동으로 인덱스가 붙어서 나열됨.

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
print(s.index)

RangeIndex(start=0, stop=5, step=1)

In [6]:
import pandas as pd
import numpy as np

s = pd.Series([10,'ars',20.3 ,30,40,50, np.nan], index = ['10-10','10-11','10-12','10-22','10-13','10-2','10-9'])
s

# np.nan = 값이 없는것.
# 인덱스도 지정해 줄 수 있음.

10-10      10
10-11     ars
10-12    20.3
10-22      30
10-13      40
10-2       50
10-9      NaN
dtype: object

In [11]:

s = pd.Series([10,20,30,40,50,60], index = pd.date_range(start = '2018-10-19', end='2018-10-24'))
s

2018-10-19    10
2018-10-20    20
2018-10-21    30
2018-10-22    40
2018-10-23    50
2018-10-24    60
Freq: D, dtype: int64

In [14]:
pd.date_range(start = '2018-10-19', end='2018-10-24')

DatetimeIndex(['2018-10-19', '2018-10-20', '2018-10-21', '2018-10-22',
               '2018-10-23', '2018-10-24'],
              dtype='datetime64[ns]', freq='D')

In [16]:
pd.date_range(start = '2018-10-19 00:00', periods = 5, freq = '3H')

DatetimeIndex(['2018-10-19 00:00:00', '2018-10-19 03:00:00',
               '2018-10-19 06:00:00', '2018-10-19 09:00:00',
               '2018-10-19 12:00:00'],
              dtype='datetime64[ns]', freq='3H')

# dict <-> Pandas

In [17]:
dt = {'한국':'서울', '호주':'캔버라', '중국':'베이징'}

In [19]:
pd_test1 = pd.Series(list(dt.values()), index=dt.keys())
pd_test1

한국     서울
호주    캔버라
중국    베이징
dtype: object

In [21]:
pd_test1 = pd.Series(dt)
pd_test1

한국     서울
호주    캔버라
중국    베이징
dtype: object

# DATA FRAME

In [25]:
df = pd.DataFrame(np.arange(12).reshape(3,4), index = pd.date_range('2018-10-01', periods = 3),
                 columns = ['a','b','c','d'])
df

            a  b   c   d
2018-10-01  0  1   2   3
2018-10-02  4  5   6   7
2018-10-03  8  9  10  11

In [26]:
table_data = {'연도':[2015,2016,2016,2017,2017],
             '지사':['한국','한국','미국','한국','미국'],
             '고객수':[200,250,450,300,500]}
table_data

{'연도': [2015, 2016, 2016, 2017, 2017],
 '지사': ['한국', '한국', '미국', '한국', '미국'],
 '고객수': [200, 250, 450, 300, 500]}

In [30]:
table_df = pd.DataFrame(table_data)

In [31]:
table_df.index

RangeIndex(start=0, stop=5, step=1)

In [32]:
table_df.columns

Index(['연도', '지사', '고객수'], dtype='object')

In [33]:
table_df.values

array([[2015, '한국', 200],
       [2016, '한국', 250],
       [2016, '미국', 450],
       [2017, '한국', 300],
       [2017, '미국', 500]], dtype=object)

# 데이터 연산 pandas

In [35]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([10,20,30,40,50])
s1-s2

0    -9
1   -18
2   -27
3   -36
4   -45
dtype: int64

In [39]:
df1 = pd.DataFrame(np.arange(12).reshape(3,4))
df1

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [43]:
df2 = pd.DataFrame(np.arange(100,108).reshape(2,4))
df2

     0    1    2    3
0  100  101  102  103
1  104  105  106  107

In [44]:
df1 + df2 
# Series 와 DafaFrame은 일반 연산 가능.
# 데이터 크기가 달라서 연산 불가능한 부분은, NaN로 표시 됨.

       0      1      2      3
0  100.0  102.0  104.0  106.0
1  108.0  110.0  112.0  114.0
2    NaN    NaN    NaN    NaN

In [46]:
table_data3 = {'봄':[365.5, 264.3,215.9,223.2,132.8],
              '여름':[770.6,547.5,599.8,387.1,446.2],
              '가을':[363.5,231.2,293.1,247.7,381.6],
              '겨울':[139.3,59.9,76.9,109.1,108.1]}
columns_list = ['봄','여름','가을','겨울']
index_list = ['2012','2013','2014','2015','2016']

df3 = pd.DataFrame(table_data3, columns = columns_list, index= index_list)
df3

          봄     여름     가을     겨울
2012  365.5  770.6  363.5  139.3
2013  264.3  547.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  132.8  446.2  381.6  108.1

In [48]:
df3.mean()
# 열에 대해서도 가능하고, 행에 대해서도 가능한데, 이게 기본 값.
# df3.mean(axis = 0 )  # 0 이 기본 값.

봄     240.34
여름    550.24
가을    303.42
겨울     98.66
dtype: float64

In [49]:
df3.mean(axis = 1)

2012    409.725
2013    275.725
2014    296.425
2015    241.775
2016    267.175
dtype: float64

In [50]:
df3.describe()

               봄          여름          가을          겨울
count    5.00000    5.000000    5.000000    5.000000
mean   240.34000  550.240000  303.420000   98.660000
std     84.69807  148.712148   67.358496   30.925523
min    132.80000  387.100000  231.200000   59.900000
25%    215.90000  446.200000  247.700000   76.900000
50%    223.20000  547.500000  293.100000  108.100000
75%    264.30000  599.800000  363.500000  109.100000
max    365.50000  770.600000  381.600000  139.300000

In [52]:
df3.T.describe()
# T는 행과 열을 바꿔줌.

             2012        2013        2014       2015        2016
count    4.000000    4.000000    4.000000    4.00000    4.000000
mean   409.725000  275.725000  296.425000  241.77500  267.175000
std    262.965807  202.118025  221.150739  114.16676  171.760034
min    139.300000   59.900000   76.900000  109.10000  108.100000
25%    307.450000  188.375000  181.150000  194.67500  126.625000
50%    364.500000  247.750000  254.500000  235.45000  257.200000
75%    466.775000  335.100000  369.775000  282.55000  397.750000
max    770.600000  547.500000  599.800000  387.10000  446.200000

In [53]:
df3.index

Index(['2012', '2013', '2014', '2015', '2016'], dtype='object')

In [54]:
df3.columns

Index(['봄', '여름', '가을', '겨울'], dtype='object')

In [55]:
df3.values

array([[365.5, 770.6, 363.5, 139.3],
       [264.3, 547.5, 231.2,  59.9],
       [215.9, 599.8, 293.1,  76.9],
       [223.2, 387.1, 247.7, 109.1],
       [132.8, 446.2, 381.6, 108.1]])

In [60]:
df3.head(2)
# 위에 두 행만 나옴.

          봄     여름     가을     겨울
2012  365.5  770.6  363.5  139.3
2013  264.3  547.5  231.2   59.9

In [63]:
df3[1:3]

          봄     여름     가을    겨울
2013  264.3  547.5  231.2  59.9
2014  215.9  599.8  293.1  76.9

In [65]:
df3.loc['2013']
# 인덱스 이름으로 선택해 줄 경우.

봄     264.3
여름    547.5
가을    231.2
겨울     59.9
Name: 2013, dtype: float64

In [66]:
df3['여름']
# 행으로 선택해 줄 경우.

2012    770.6
2013    547.5
2014    599.8
2015    387.1
2016    446.2
Name: 여름, dtype: float64

In [68]:
df3['여름']['2012':'2014']

2012    770.6
2013    547.5
2014    599.8
Name: 여름, dtype: float64

In [71]:
df4 = df3.T
df4[['2012','2014']]

     2012   2014
봄   365.5  215.9
여름  770.6  599.8
가을  363.5  293.1
겨울  139.3   76.9

# 데이터 통합

In [77]:
df1.append(df2, ignore_index=True)
# ignore_index = True

     0    1    2    3
0    0    1    2    3
1    4    5    6    7
2    8    9   10   11
3  100  101  102  103
4  104  105  106  107

In [75]:
df3 = pd.DataFrame(np.arange(12).reshape(3,4), columns=['a','b','c','d'])

In [76]:
df3.join(df2)
# 가로

   a  b   c   d      0      1      2      3
0  0  1   2   3  100.0  101.0  102.0  103.0
1  4  5   6   7  104.0  105.0  106.0  107.0
2  8  9  10  11    NaN    NaN    NaN    NaN

### Merge

In [78]:
df_A_B = pd.DataFrame({'판매월':['1월','2월','3월','4월'],
                       '제품A':[100,150,200,130],
                       '제품B':[90,110,140,170]})
df_A_B

  판매월  제품A  제품B
0  1월  100   90
1  2월  150  110
2  3월  200  140
3  4월  130  170

In [82]:
df_C_D = pd.DataFrame({'판매월':['1월','2월','3월','5월'],
                       '제품C':[112,141,203,134],
                       '제품D':[90,110,140,170]})
df_C_D

  판매월  제품C  제품D
0  1월  112   90
1  2월  141  110
2  3월  203  140
3  5월  134  170

In [84]:
df_A_B.merge(df_C_D)
# 디폴트 값이 how = 'inner'

  판매월  제품A  제품B  제품C  제품D
0  1월  100   90  112   90
1  2월  150  110  141  110
2  3월  200  140  203  140

In [83]:
df_A_B.merge(df_C_D, how = 'inner', on = '판매월')
# 4월이 없고, 5월만 있기 때문에 1,2,3월만 나옴.

  판매월  제품A  제품B  제품C  제품D
0  1월  100   90  112   90
1  2월  150  110  141  110
2  3월  200  140  203  140

In [85]:
df_A_B.merge(df_C_D, how='right', on='판매월')
# right 기준이므로 df_C_D로 해서 4월이 없고 5월이 있음.

  판매월    제품A    제품B  제품C  제품D
0  1월  100.0   90.0  112   90
1  2월  150.0  110.0  141  110
2  3월  200.0  140.0  203  140
3  5월    NaN    NaN  134  170

In [86]:
df_A_B.merge(df_C_D, how='outer', on='판매월')

  판매월    제품A    제품B    제품C    제품D
0  1월  100.0   90.0  112.0   90.0
1  2월  150.0  110.0  141.0  110.0
2  3월  200.0  140.0  203.0  140.0
3  4월  130.0  170.0    NaN    NaN
4  5월    NaN    NaN  134.0  170.0

In [88]:
df_A_B.merge(df_C_D, how='left', on='판매월')

  판매월  제품A  제품B    제품C    제품D
0  1월  100   90  112.0   90.0
1  2월  150  110  141.0  110.0
2  3월  200  140  203.0  140.0
3  4월  130  170    NaN    NaN

# CSV

In [93]:
iris = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data", 
                   names = ['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'class'])

In [94]:
iris

     sepal_length  sepal_width  petal_length  petal_width           class
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
5             5.4          3.9           1.7          0.4     Iris-setosa
6             4.6          3.4           1.4          0.3     Iris-setosa
7             5.0          3.4           1.5          0.2     Iris-setosa
8             4.4          2.9           1.4          0.2     Iris-setosa
9             4.9          3.1           1.5          0.1     Iris-setosa
10            5.4          3.7           1.5          0.2     Iris-setosa
11            4.8          3.4           1.6          0.2     Iris-setosa
12            4.8          3.0           1.4          0.1     Iris-setosa
13            4.3          3.0           1.1          0.1     Iris-setosa
14            5.8          4.0           1.2          0.2     Iris-setosa
15            5.7          4.4           1.5          0.4     Iris-setosa
16            5.4          3.9           1.3          0.4     Iris-setosa
17            5.1          3.5           1.4          0.3     Iris-setosa
18            5.7          3.8           1.7          0.3     Iris-setosa
19            5.1          3.8           1.5          0.3     Iris-setosa
20            5.4          3.4           1.7          0.2     Iris-setosa
21            5.1          3.7           1.5          0.4     Iris-setosa
22            4.6          3.6           1.0          0.2     Iris-setosa
23            5.1          3.3           1.7          0.5     Iris-setosa
24            4.8          3.4           1.9          0.2     Iris-setosa
25            5.0          3.0           1.6          0.2     Iris-setosa
26            5.0          3.4           1.6          0.4     Iris-setosa
27            5.2          3.5           1.5          0.2     Iris-setosa
28            5.2          3.4           1.4          0.2     Iris-setosa
29            4.7          3.2           1.6          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
120           6.9          3.2           5.7          2.3  Iris-virginica
121           5.6          2.8           4.9          2.0  Iris-virginica
122           7.7          2.8           6.7          2.0  Iris-virginica
123           6.3          2.7           4.9          1.8  Iris-virginica
124           6.7          3.3           5.7          2.1  Iris-virginica
125           7.2          3.2           6.0          1.8  Iris-virginica
126           6.2          2.8           4.8          1.8  Iris-virginica
127           6.1          3.0           4.9          1.8  Iris-virginica
128           6.4          2.8           5.6          2.1  Iris-virginica
129           7.2          3.0           5.8          1.6  Iris-virginica
130           7.4          2.8           6.1          1.9  Iris-virginica
131           7.9          3.8           6.4          2.0  Iris-virginica
132           6.4          2.8           5.6          2.2  Iris-virginica
133           6.3          2.8           5.1          1.5  Iris-virginica
134           6.1          2.6           5.6          1.4  Iris-virginica
135           7.7          3.0           6.1          2.3  Iris-virginica
136           6.3          3.4           5.6          2.4  Iris-virginica
137           6.4          3.1           5.5          1.8  Iris-virginica
138           6.0          3.0           4.8          1.8  Iris-virginica
139           6.9          3.1           5.4          2.1  Iris-virginica
140           6.7          3.1           5.6          2.4  Iris-virginica
141           6.9          3.1           5.1          2.3  Iris-virginica
142           5.8          2.7           5.1          1.9  Iris-virginica
143           6.8          3.2           5.9          2.3  Iris-virginica
144           6.7          3.3           5.7          2.5  Iris-virginica
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [95]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [96]:
iris_des_df = iris.describe()

In [97]:
iris_des_df.head()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000

In [101]:
iris_des_df.to_csv('C:/test/iris_des_csv')
# csv 파일로 저장.